require('dotenv').config()
const sequelize = require('./db') 
const { Device, Brand, Type } = require('./models/models')

const start = async () => {
    try {
        await sequelize.authenticate()
        
        // ⚠️ УВАГА: force: true очищає базу даних!
        await sequelize.sync({ force: true })

        // 1. Створюємо Категорії та Бренди
        const [brand] = await Brand.findOrCreate({ where: { name: 'Forma3D' } })
        
        const [typeFigurine] = await Type.findOrCreate({ where: { name: 'Фігурки' } })
        const [typeUseful] = await Type.findOrCreate({ where: { name: 'Корисне' } })
        const [typeAccessory] = await Type.findOrCreate({ where: { name: 'Аксесуари' } })

        console.log('Категорії створено.')

        // 2. Список товарів з КОЛЬОРАМИ (colors)
        const products = [
            { 
                name: '3D Фігурка динозавр Діно Рекс', 
                price: 100, 
                img: 'image/trex.jpg', 
                brandId: brand.id, 
                typeId: typeFigurine.id,
                description: 'Ця деталізована фігурка динозавра Діно Рекс виготовлена з екологічно чистого та міцного PLA-пластику. Фігурка представляє собою чудово опрацьовану модель динозавра, яка ідеально підійде для дитячих ігор та колекцій. Виготовлена з особливою увагою до деталей, вона дозволяє дітям не лише насолоджуватися іграшкою, але й дізнатися більше про цих величних істот, які жили на Землі мільйони років тому. Це ідеальний подарунок для хлопчиків і дівчаток, які люблять динозаврів та хочуть мати у своїй колекції оригінальну іграшку.',
                info: 'Для дітей, які захоплюються динозаврами та природною історією. Для колекціонерів або тих, хто любить незвичні 3D фігурки. Ідеальний подарунок для хлопчиків і дівчаток від 5 років і старше. Чудовий елемент для дитячих кімнат або для тематичних свят.',
                images: JSON.stringify(['image/trex.jpg']),
                // 👇 Додаємо кольори для Діно
                   colors: JSON.stringify([
                    { name: 'червоний', hex: '#FF0000', },
                    { name: 'жовтий',   hex: '#FFFF00',  },
                    { name: 'синій',    hex: '#0000FF',  },
                    { name: 'зелений',  hex: '#008000', },
                    { name: 'чорний',   hex: '#000000', },
                    { name: 'білий',    hex: '#FFFFFF', }
                ])
            },
            { 
                name: 'Фігура кам’яного обличчя', 
                price: 200, 
                img: 'image/face.jpg', 
                brandId: brand.id, 
                typeId: typeFigurine.id,
                description: 'Ця фігура, стилізована під старовинну кам’яну скульптуру, стане чудовим елементом декору для вашого дому чи офісу. Її автентичний вигляд переносить нас у часи античних цивілізацій, а також додасть інтер’єру загадковості та інтелектуальної глибини. Може бути використана для фотозон, колекцій, або просто як розмовний елемент для вашої кімнати.   ',
                info: 'Для любителів історії та культури. Ідеально підходить для декору приміщень у стилі ретро чи класика. Чудовий подарунок для колекціонерів старовинних предметів.',
                images: JSON.stringify(['image/face.jpg']),
                     colors: JSON.stringify([
                           { name: 'червоний', hex: '#FF0000', },
                    { name: 'жовтий',   hex: '#FFFF00',  },
                    { name: 'синій',    hex: '#0000FF',  },
                    { name: 'зелений',  hex: '#008000', },
                    { name: 'чорний',   hex: '#000000', },
                    { name: 'білий',    hex: '#FFFFFF', }
                ])
            },
            { 
                name: 'Підставка під телефон', 
                price: 150, 
                img: 'image/stand.png', 
                brandId: brand.id, 
                typeId: typeUseful.id,
                description: 'Ця підставка під телефон виготовлена з легкого, але міцного PLA-пластику, що робить її ідеальною для повсякденного використання. Вона сумісна з будь-якими смартфонами та надає зручність при перегляді відео, читанні новин або використанні навігації. Виготовлена в стильному, сучасному дизайні, вона не лише зручна, але й стане прикрасою вашого робочого столу чи ночного столика.', 
                info: 'Для тих, хто часто користується смартфоном для роботи або розваг. Чудовий аксесуар для офісу чи дому. Подарунок для людей, які цінують зручність у використанні техніки.',
                images: JSON.stringify(['image/stand.png']),
                // 👇 Кольори підставки
                    colors: JSON.stringify([
                           { name: 'червоний', hex: '#FF0000', },
                    { name: 'жовтий',   hex: '#FFFF00',  },
                    { name: 'синій',    hex: '#0000FF',  },
                    { name: 'зелений',  hex: '#008000', },
                    { name: 'чорний',   hex: '#000000', },
                    { name: 'білий',    hex: '#FFFFFF', }
                ])
            },
            { 
                name: 'Брелок у формі середнього пальця', 
                price: 50, 
                img: 'image/finger.jpg', 
                brandId: brand.id, 
                typeId: typeAccessory.id,
                description: 'Цей незвичний брелок — це аксесуар з характером, який точно приверне увагу. Він виготовлений з високоякісного матеріалу, що забезпечує довговічність, а його гумористичний дизайн і сміливе зображення середнього пальця робить його справжнім акцентом серед інших аксесуарів. Такий брелок стане ідеальним для тих, хто не боїться виразити свою індивідуальність.', 
                info: 'Для любителів незвичайних і оригінальних аксесуарів. Ідеально підходить для молоді та тих, хто любить гумор. Подарунок для друзів або колег, які мають почуття гумору.',
                images: JSON.stringify([
                    'image/finger.jpg', 
                    'image/finger 2.jpg', 
                    'image/finger 3.jpg', 
                    'image/finger 4.jpg', 
                    'image/finger 5.jpg', 
                    'image/finger 6.jpg'
                ]),
                // 👇 ВАЖЛИВО: Тут пропишіть правильні шляхи до фото кожного кольору
                colors: JSON.stringify([
                    { name: 'білий',    hex: '#FFFFFF', img: 'image/finger.jpg' },
                    { name: 'синій',    hex: '#0000FF', img: 'image/finger 2.jpg' },
                    { name: 'зелений',  hex: '#008000', img: 'image/finger 3.jpg' },
                    { name: 'червоний', hex: '#FF0000', img: 'image/finger 4.jpg' },
                    { name: 'жовтий',   hex: '#FFFF00', img: 'image/finger 5.jpg' },
                    { name: 'чорний',   hex: '#000000', img: 'image/finger 6.jpg' },
                ])
            },
            { 
                name: 'Кейс для microSD-карт', 
                price: 150, 
                img: 'image/case.jpg', 
                brandId: brand.id, 
                typeId: typeUseful.id,
                description: 'Кейс для microSD-карт — це компактне і надійне рішення для зберігання ваших карт пам’яті. Захищає картки від пилу, вологи, механічних пошкоджень і втрати. Має продуману внутрішню структуру з виїмками, які надійно фіксують кожну карту. Ідеально підходить для подорожей, зйомок або просто впорядкованого зберігання вдома чи в офісі.', 
                info: 'Для фотографів, відеографів, блогерів, користувачів дронів, а також всіх, хто працює з великою кількістю карт пам’яті. Незамінна річ для тих, хто цінує порядок, безпеку та швидкий доступ до важливої інформації. Добре підходить як подарунок для технічних спеціалістів або творчих людей.',
                images: JSON.stringify([
                    'image/case.jpg', 
                    'image/case 2.jpg', 
                    'image/case 3.jpg', 
                    'image/case 4.jpg', 
                    'image/case 5.jpg', 
                    'image/case 6.jpg'
                ]),
                // 👇 Кольори кейсів
                colors: JSON.stringify([
                    { name: 'білий',    hex: '#FFFFFF', img: 'image/case.jpg' },
                    { name: 'червоний', hex: '#FF0000', img: 'image/case 2.jpg' },
                    { name: 'синій',    hex: '#0000FF', img: 'image/case 3.jpg' },
                    { name: 'жовтий',   hex: '#FFFF00', img: 'image/case 4.jpg' },
                    { name: 'зелений',  hex: '#008000', img: 'image/case 5.jpg' },
                    { name: 'чорний',   hex: '#000000', img: 'image/case 6.jpg' },
                ])
            },
            { 
                name: 'Тримач ременя', 
                price: 70, 
                img: 'image/large.jpg', 
                brandId: brand.id, 
                typeId: typeUseful.id,
                description: 'Тримач ременя — це зручний аксесуар, який фіксує вільний кінець ременя, не даючи йому стирчати чи заважати. Компактний і майже непомітний, він допомагає зберігати охайний вигляд одягу протягом усього дня. Простий у використанні та підходить до більшості стандартних ременів.', 
                info: 'Для тих, хто цінує акуратність і комфорт у щоденному одязі. Ідеальний для офісних працівників, студентів, водіїв і всіх, хто часто носить ремінь. Чудовий варіант для подарунку людям, які люблять порядок у деталях.',
                images: JSON.stringify(['image/large.jpg']),
                        colors: JSON.stringify([
                    { name: 'червоний', hex: '#FF0000', },
                    { name: 'жовтий',   hex: '#FFFF00',  },
                    { name: 'синій',    hex: '#0000FF',  },
                    { name: 'зелений',  hex: '#008000', },
                    { name: 'чорний',   hex: '#000000', },
                    { name: 'білий',    hex: '#FFFFFF', }
                ])
            },
            { 
                name: 'Ручка для пакетів', 
                price: 200, 
                img: 'image/ruchka.jpg', 
                brandId: brand.id, 
                typeId: typeUseful.id,
                description: 'Ручка для пакетів — це зручний аксесуар, що полегшує перенесення важких сумок або поліетиленових пакетів. Вона рівномірно розподіляє навантаження і захищає руки від натирання чи болю, особливо при тривалому носінні. Легка, компактна та багаторазова — завжди стане у пригоді в повсякденному житті.', 
                info: 'Для тих, хто часто ходить за покупками або носить сумки з продуктами. Ідеально підходить для пенсіонерів, мам з дітьми, дачників або будь-кого, хто хоче зменшити навантаження на руки. Корисний подарунок для практичних людей.',
                images: JSON.stringify([
                    'image/ruchka.jpg', 
                    'image/ruchka 5.jpg', 
                    'image/ruchka 4.jpg', 
                    'image/ruchka 6.jpg',
                    'image/ruchka 3.jpg', 
                    'image/ruchka 2.jpg', 
                ]),
                colors: JSON.stringify([
                    { name: 'білий',    hex: '#FFFFFF', img: 'image/ruchka.jpg' },
                    { name: 'червоний', hex: '#FF0000', img: 'image/ruchka 5.jpg' },
                    { name: 'жовтий',   hex: '#FFFF00', img: 'image/ruchka 4.jpg' },
                    { name: 'синій',    hex: '#0000FF', img: 'image/ruchka 6.jpg' },
                    { name: 'зелений',  hex: '#008000', img: 'image/ruchka 2.jpg' },
                    { name: 'чорний',   hex: '#000000', img: 'image/ruchka 3.jpg' }
                ])
            },
            { 
                name: 'Заглушка на болт', 
                price: 50, 
                img: 'image/zaglushka.png', 
                brandId: brand.id, 
                typeId: typeAccessory.id,
                description: 'Заглушка на болт — це невеликий, але важливий елемент, який забезпечує акуратний зовнішній вигляд та додатковий захист кріплень. Виготовлена з міцного матеріалу, вона захищає болт від пилу, вологи та корозії. Має естетичний вигляд, що дозволяє гармонійно завершити будь-яку конструкцію чи виріб.', 
                info: 'Для майстрів, автолюбителів, будівельників та всіх, хто цінує охайність і довговічність своїх проектів. Ідеальна для побутового, автомобільного чи промислового використання. Підходить тим, хто хоче надати деталям завершеного, професійного вигляду.',
                images: JSON.stringify(['image/zaglushka.png']),
                colors: JSON.stringify([
                           { name: 'червоний', hex: '#FF0000', },
                    { name: 'жовтий',   hex: '#FFFF00',  },
                    { name: 'синій',    hex: '#0000FF',  },
                    { name: 'зелений',  hex: '#008000', },
                    { name: 'чорний',   hex: '#000000', },
                    { name: 'білий',    hex: '#FFFFFF', }
                ])
            }
        ]

        // 3. Записуємо товари в базу
        for (const p of products) {
            await Device.create(p)
            console.log(`Додано: ${p.name}`)
        }

        console.log('--- База даних повністю оновлена! ---')
        process.exit()

    } catch (e) {
        console.error('Помилка:', e)
        process.exit(1)
    }
}

start()